[
{"Title": "jenny mod", "Description": "its for java it works in bedrock but no as good have fun u pervs make sure u know what your getting into before u get it there are lots of weird videos on this u can go check them out", "Published time": "11/13/22 12:01 pm", "Views": 24, "Downloads": 4, "Credit": null, "Progress": "100% complete", "Game Version": "Minecraft 1.18", "Tags": "Other"},
{"Title": "Mob Vote '22", "Description": "A mod that adds the Sniffer, Rascal, and Tuff Golem from the 2022 mob vote as well as what they could / could have brought to the game with them.- About -- Sniffer - The first fluffy looking mob seen in the mob vote. (And winner of the vote!) - Sniffers are large prehistoric mobs that love nature, especially flowers! - Sniffers have short red hair and long greenish-blue hair on their body. (Often leaves and twigs get caught in their long hair!) - They have gone almost extinct over the centuries but some of their eggs can be found dormant at the bottom of the ocean. (Usually in certain underwater ruins.) - Sniffer eggs will only hatch when placed on dry land under the warmth of the sun. - Be careful, sniffer eggs are extremely fragile and anything stepping or falling on them could break it! - After a while the egg will hatch into a baby sniffer and then mature into an adult. - Once an adult sniffers can be given any type of flower to sniff. - When given a flower sniffers will sniff out and dig up old and unknown seeds depending on the terrain!(Grassy or dirt-like blocks will give mysterious seeds. Sandy type blocks will give glowing seeds. Rough blocks like gravel will give spiny seeds. Sniffers are unable to dig into solid surfaces like stone.) - Sniffers can dig the best on flat surfaces as it's hard for them to dig on slopes!- New Seeds - The long forgotten seeds that can be dug up by the sniffer. - These seeds can be planted anywhere in dirt or grass. - You can use bone meal on any of these new plants like any other crop.- Mysterious seeds:- These old seeds will sprout a vine that grows mysterious fruits.- These special fruits seem to have a random effect on whoever eats them. (Sometimes good sometimes bad.) - Sniffers absolutely love these tiny fruits as they are unaffected by them unlike players. - Mysterious fruits can be used to speed up the growth of baby sniffers as well as breed adult sniffers!- Glowing Seeds:- These shiny seeds seem to produce light even as a seed. - The more the plant grows the brighter the light it produces becomes.- When fully grown you can harvest the glowing flower from them. - This flower can be used with sticks to make a glowing flower torch. - These flowers also double as food! (They don't provide much food though.)- Spiny Seeds:- These spiked seeds will grow into a thorny bush over time. (They're painful to walk through!)- When fully grown these bushes will produce the long lost cyan rose! - Cyan roses can be picked and planted individually. - They can also be used to craft cyan dye - Rascal - The second mischievous mob seen in the mob vote. - Rascals live deep underground in caves and mineshafts. - They love to play hide and seek with everyone! - Right-click a rascal to find them. (It's more like hide and seek tag.) - When found a rascal might throw a special potion that helps them hide but makes it harder for you to find them if you get caught in the splash. (Crafty!) - When found 3 times a rascal will give you a random reward as a thanks for playing! - These rewards can vary between tools, ores, or even ancient treasures!- Ancient Treasures:- These are tools made of deepslate and reinforced with skulk and ancient bone!- A rascal can give you tools made of this material or even just the raw ancient bones! - Ancient bones are a super sturdy material made of similar parts seen in reinforced deepslate. (How did the rascal get a hold of these?) - Tools can be crafted like normal and repaired using these mysterious materials. - These tools seem to be the middle ground between iron and diamond.- Tuff Golem - The third mob, a statue come to life seen in the mob vote. - Can be crafted using a pumpkin on top of a carpet on top of a tuff block in a crafting table. (How do pumpkins seemingly bring golems to life? Has nobody researched this?) - The tuff golem has the ability to transform between a living entity and a stone statue! - When right clicked while sneaking you can transform this statue between living and stone. - They have a strange obsession with holding items. (Especially hats.) - Tuff golems will follow players holding a leather hat. - When right clicked with an item (Only leather hats for now (I'm not that good at coding)) they will hold it using their cloth and arms as a built in display stand! - When right clicked again they will give it back. - Tuff golems can be given items to display in both living and statue form!", "Published time": "11/8/22 9:35 am", "Views": 302, "Downloads": 87, "Credit": "Mob vote mob concepts by Mojang", "Progress": "100% complete", "Game Version": "Minecraft 1.19.2", "Tags": "New Content, Mod, Tools, Mobs, Tool, Mob, Plants, Flowers, Hat, Hats, Sniffer, Mobvote, Rascal, Mobvote2022, Tuffgolem, Nickyb1106"},
{"Title": "YDM's Scorpions [1.16.5/1.17.1/ 1.18.1/1.18.2/1.19]", "Description": "YDM's Scorpions for FORGE/FABRIC [​1.16.5/1.17.1/ 1.18.1/1.18.2/1.19.2]This mod adds scorpions to the game!Brown and Emperor Scorpion spawns in the desert, while the Nether Scorpion Spawns in the Soul Sand Valley.They will burrow themself in to the ground on daylight.They drop Scorpion stingers that can be brewed into Venom Coat Potion.After consuming this potion you will get a venom \"armor\" that will poison attackers!Other mod biome compatibility!Spawn config options:- Biome name(s) where it should spawn- Spawn rate (The higher, the more chance for spawning a group)- Minimum and maximum number of a Group- Poison Duration (20 means -> 20 seconds)- Health Points- Damage ValueYou can find the config for it in your run folder.If you want the scorpions to spawn in another mods biome.You have to change the biome_name line:For example to:biome_name = \"modid:name_of_the_biome\"To let it spawn in more biomes you have to put a comma (,) between the biome names like this:biome_name = \"modid:name_of_the_biome,minecraft:desert\"The 1.19 version doesn't have a spawn config. The biome world generation changed a bit and now the spawn settings will be editable in json files. To select the desired biomes for the mob you have to edit the biome tags. (/data/scorpions/tags/worldgen/biome/...)To edit the spawn settings you have to edit the biome_modifier (/data/scorpions/forge/biome_modifier/...)Suggested by: gohkenytpThanks for downloading this mod!﻿", "Published time": "2/9/22 4:16 pm", "Views": 3220, "Downloads": 253, "Credit": "minecraftserverzone.com, gohkenytp", "Progress": "100% complete", "Game Version": "Minecraft 1.19", "Tags": "Forge, Mob, Monster, Scorpion, Other, Fabric, 116mod, 1165mod, 116mos, 1171mod, 119mod, 118mod, 119update, 1181mod"},
{"Title": "CrimsonSteve's more mobs", "Description": "Summary:This mod adds many random mobs. For now, there are 27 mobs in total.Explanation of mobs:redstone powered iron golemVillagers needed a better bodyguard than default iron golems, so they researched illager's and made their own. This mob naturally spawns in the village rarely, protecting villagers from monsters and raids. Occasionally rushes toward its target and deals massive damage.In the future, some villagers with a specific profession will sell this massive golem.big snow golemThis mob spawns in snowy biomes rarely and can be tamed with a carved pumpkin. You can also heal it with snowballs after taming it. Throws big snowballs toward its target, and sometimes it uses its offhand to shoot a large amount of snowballs. Its attack continuously freezes targets, and when it attacks a completely frozen target, it defrosts the target and deals additional damage.reanimated templeA kind of boss in this mod, spawning in the jungle. It wields its arms for attacks, causing earthquakes that deal additional damage. Damage of its attacks is based on its attack-damage amount.crude redstone monstrositySeems that illagers used the wrong blueprint. Yet, it is strong enough. It occasionally opens its belly and casts a special attack.1. Summoning minion golems2. Shooting redstone bombs.Also, it generates some long-ranged earthquakes toward its target.For now, it appears in the raids only.redstone monstrosityIllagers finally got the right blueprint! This giant monster has three attacks for now.1. Swinging its arms2. Inserting the arms and summoning minions3. Shooting redstone bombsAlso, its attack speed increases as its health get lower.HP  attack speed75%  25%50%  50%25%  75%For now, it appears in the raids only.elite ender ravagerIt spawns rarely in the ender world or overworld. It has a massive amount of damage, but there's some delay until the attack hits the target, so using ranged weapons to stop its attacks is recommended highly. Also, it is stunned for a while if you block its attacks with the shield, like usual ravagers.zombified illagersThey spawn at night and have similar properties to their original form, except the zombie evoker. It has four attacks in total.These are the lists of its attacks.1. Summoning 3 zombie illagers2. Summoning evoker fangs near the target for about 2 seconds3. Summoning a zombie ravager4. Making a cloud of instant damage effectphantom tamerAn illager that loves collecting and training phantoms to its own taste. It spawns at night very rarely or raids, and has 5 attacks in total.1. Generating earthquakes around it2. Summoning magical projectiles that falls after a few seconds3. Summoning two usual phantoms4. Summoning an explosive phantom5. Summoning a giant phantom and riding itSummoned phantoms have their lifetime like vexes summoned by evokers.cyborg vindicatorA giant & muscular vindicator made with some chemicals and mechanical stuff. It appears in the raids or patrol troops. For the patrol troops, it only appears when the world time is more than 360000, 15 days of minecraft. Sometimes, it runs in the place for a while and rushes toward its target. The direction of it won't change once start rushing. While rushing, it deals damage to all non-allied mobs in its way and makes explosions when the rush ends.When its health is below 40%, it starts fixing itself to full health. This can be recharged as time passes.Even after death, it will stand back and become raged state. In this state, its health wipes out at a constant rate based on its max health.T-rabusIllagers got a hoglin from nether and made it into the massive war machine. It only spawns in the raids.Its battle style is like a bulldozer, moving fast and dealing massive area damage and knockback to its enemies, confusing the battlefield. You will need a bucket of water when fighting against it, or you are highly likely to be killed from falling.There are some mobs I didn't explain above. Try the mod and find out who are they, and how they behave!Credits:Illager phantom tamer / Re-Remade / Re-texturing Minecraft Mob Skin (planetminecraft.com)kromadimator on Planet MinecraftWallEtheRobot on Planet MinecraftPavager Minecraft Mob Skin (planetminecraft.com)T. Rabus (Boss) Minecraft Mob Skin (planetminecraft.com)Zombified cow Minecraft Mob Skin (planetminecraft.com)﻿MCreator - The Best Minecraft Mod Maker Ever", "Published time": "10/18/22 3:54 pm", "Views": 2910, "Downloads": 412, "Credit": null, "Progress": "20% complete", "Game Version": "Minecraft 1.19.2", "Tags": "New Content, Mobs, Monsters, Hardcore, Weird, Mobbattle"},
{"Title": "TU-160 | MCHeli Addon | 1.7.10", "Description": "The Tu-160 is a Soviet and Russian intercontinental supersonic strategic bomber with a variable sweep wing (multi—mode), developed at the Tupolev Design Bureau in the 1970s.There are two X-55M TV missiles in serviceТу-160 — советский и российский межконтинентальный сверхзвуковой стратегический бомбардировщик-ракетоносец с крылом изменяемой стреловидности (многорежимный), разработанный в ОКБ Туполева в 1970-х годах.На вооружении есть две ТВ ракеты Х-55М", "Published time": "11/12/22 5:38 am", "Views": 425, "Downloads": 124, "Credit": null, "Progress": "100% complete", "Game Version": "Minecraft 1.7.10", "Tags": "Mcheli, Soviet, Planes, Plane, Mchelicopter, Other, Mchelicontent, Tu160, Tupolev"},
{"Title": "spongebob characters", "Description": "hi byehehehehehehehi byehehehehehehehi byehehehehehehehi byehehehehehehehi byehehehehehehehi byehehehehehehehi byehehehehehehehi byehehehehehehehi byehehehehehehehi byehehehehehehehi byehehehehehehehi byehehehehehehehi byehehehehehehehi byehehehehehehehi byehehehehehehehi byehehehehehehehi byehehehehehehehi byehehehehehehehi byehehehehehehehi byehehehehehehehi byehehehehehehehi byehehehehehehehi byehehehehehehehi byehehehehehehehi byehehehehehehehi byehehehehehehehi byehehehehehehehi byehehehehehehehi byehehehehehehehi byehehehehehehehi byehehehehehehehi byehehehehehehehi byehehehehehehehi byehehehehehehehi byehehehehehehehi byehehehehehehehi byehehehehehehehi byehehehehehehehi byehehehehehehehi byehehehehehehehi byehehehehehehehi byehehehehehehehi byehehehehehehehi byehehehehehehehi byehehehehehehehi byehehehehehehehi byehehehehehehehi byehehehehehehehi byehehehehehehehi byehehehehehehehi byehehehehehehehi byehehehehehehehi byehehehehehehehi byehehehehehehehi byehehehehehehehi byehehehehehehehi byehehehehehehehi byehehehehehehehi byehehehehehehehi byehehehehehehehi byehehehehehehe", "Published time": "11/13/22 9:56 am", "Views": 36, "Downloads": 0, "Credit": null, "Progress": "100% complete", "Game Version": "Minecraft 1.18", "Tags": "Other"},
{"Title": "[MC Heli] 9K33 Osa", "Description": "The 9K33 Osa (Russian: 9К33 «Оса», literally \"wasp\"; NATO reporting name SA-8 Gecko) is a highly mobile, low-altitude, short-range tactical surface-to-air missile system developed in the Soviet Union in the 1960s and fielded in 1972.I made this for personal use so do not expect it to be balanced or be modeled accurately. Simply extract the mcheli folder from the ZIP and add it into your mods folder, replace anything if needed.", "Published time": "11/12/22 1:26 am", "Views": 368, "Downloads": 106, "Credit": null, "Progress": "100% complete", "Game Version": "Minecraft 1.7.10", "Tags": "New Content, Russia, Mcheli, Military, Mchelicopter, Mchelicontent, Mcheliaddon"},
{"Title": "[MC Heli] Type 63", "Description": "The Type 63 multiple rocket launcher is a towed, 12-tube, 107mm rocket launcher produced by the People's Republic of China in the early 1960s and later exported and manufactured globally.This vehicle includes 3 rocket variants from close to \"long\" range.I made this for personal use so do not expect it to be balanced or be modeled accurately.Simply extract the mcheli folder from the ZIP and add it into your mods folder, replace anything if needed.", "Published time": "11/12/22 2:23 am", "Views": 245, "Downloads": 85, "Credit": null, "Progress": "100% complete", "Game Version": "Minecraft 1.7.10", "Tags": "China, Mcheli, Military, Mchelicopter, Other, Mchelicontent, Mcheliaddon"},
{"Title": "Superior Hammers!", "Description": "Hammers Extension is a vanilla-friendly forge mod, adding hammer tools to your game and letting you mine 3x3x1 blocks (the same block types as pickaxe)Besides normal hammers, there are also Enhanced Hammers. The two most important aspects of normals hammers is their durability, which is 10% better than pickaxes', regardless of each ore, and their efficiency, which is a bit worse (slower), compared to pickaxes.Whereas Enhanced Hammers' durability is 30% better than pickaxes' and also the efficiency is a bit higher (faster)! What's the catch with them? They are harder to craft, naturally, for example, you're gonna need an Enhanced Stick instead of a regular one. You'll find all the craftings below, however, I recommend JEI for that.CRAFTINGS:You can join me on my server Marwinekk's mods to see how my mods are being developed. Also, if you like my modding style, you can suggest what next QoL mod I could do for you!Join the discord or donate to support me, so I can improve the mods' quality with more advanced programs!If you wish to use this in a modpack, feel free to do so and let me know if you do!Also, check out my other similar mods:Double Axes: www.curseforge.com/minecraft/mc-mods/double-axes-extensionSpades: www.curseforge.com/minecraft/mc-mods/spades-extensionAll the tools in one: www.curseforge.com/minecraft/mc-mods/tools-extension", "Published time": "12/29/21 8:17 am", "Views": 7714, "Downloads": 1647, "Credit": null, "Progress": "100% complete", "Game Version": "Minecraft 1.19.2", "Tags": "Functional, Tools, Tool, Useful, Hammers, Hammer, Digging, Qol, Toolsplus, Hammermod, 3x3"},
{"Title": "Spades!", "Description": " Spades Extension! is a vanilla-friendly forge mod, adding spade tools to your game and letting you dig ground 3x3x1 blocks (for example dirt, sand, or gravel)Besides normal spades, there are also Enhanced Spades. The two most important aspects of normal spades is their durability, which is 10% better than shovels', regardless of each ore, and their efficiency, which is a bit worse (slower), compared to shovels.Whereas Enhanced Spades' durability is 30% better than shovels' and also the efficiency is a bit higher (faster)! What's the catch with them? They are harder to craft, naturally, for example, you're gonna need an Enhanced Stick instead of a regular one. You'll find all the craftings below, however, I recommend JEI for that.CRAFTINGS:CRAFTINGS:You can join me on my server Marwinekk's mods to see how my mods are being developed.Also, if you like my modding style, you can suggest what next QoL mod I could do for you!Join the discord or donate to support me, so I can improve the mods' quality with more advanced programs!If you wish to use this in a modpack, feel free to do so and let me know if you do!Also, check out my other similar mods:Hammers: www.curseforge.com/minecraft/mc-mods/hammers-extensionDouble Axes: www.curseforge.com/minecraft/mc-mods/double-axes-extensionAll the tools in one: www.curseforge.com/minecraft/mc-mods/tools-extension", "Published time": "1/3/22 6:14 pm", "Views": 1736, "Downloads": 190, "Credit": null, "Progress": "100% complete", "Game Version": "Minecraft 1.19.2", "Tags": "Functional, Tools, Tool, Useful, Easy, Shovel, Shovels, Dirt, Spade, Sand, Gravel, Digging, Easier, Spades, 3x3"},
{"Title": "Double Axes!", "Description": "Double Axes Extension! is a vanilla-friendly forge mod, adding double axe tools to your game and letting you mine 3x3x1 blocks (wood block types)Besides normal double axes, there are also Enhanced Double Axes. The two most important aspects of normal double axes is their durability, which is 10% better than vanilla axes', regardless of each ore, and their efficiency, which is a bit worse (slower), compared to vanilla axes.Whereas Enhanced Double Axes' durability is generally 30% better than axes' and also the efficiency is a bit higher (faster)! What's the catch with them? They are harder to craft, naturally, for example, you're gonna need an Enhanced Stick instead of a regular one. You'll find all the craftings below, however, I recommend JEI for that.CRAFTINGS:CRAFTINGS:You can join me on my server Marwinekk's mods to see how my mods are being developed. Also, if you like my modding style, you can suggest what next QoL mod I could do for you!Join the discord or donate to support me, so I can improve the mods' quality with more advanced programs!If you wish to use this in a modpack, feel free to do so and let me know if you do!Also, check out my other similar mods:Hammers: www.curseforge.com/minecraft/mc-mods/hammers-extensionSpades: www.curseforge.com/minecraft/mc-mods/spades-extensionAll the tools in one: www.curseforge.com/minecraft/mc-mods/tools-extension", "Published time": "1/3/22 8:45 am", "Views": 2743, "Downloads": 531, "Credit": null, "Progress": "100% complete", "Game Version": "Minecraft 1.19.2", "Tags": "Functional, Tools, Tool, Mining, Axes, Axe, Rpg, Addons, Double, Quality, Qol, Toolsplus, Qualityoflife, 3x3, Doubleaxe"},
{"Title": "Spaxers & Vanilla Tools 3x3!", "Description": "﻿﻿Spaxers & Vanilla Tools 3x3! is a QoL vanilla-friendly mod, adding new 3x3x1 mining tools.It adds 3 main tools: Hammers, which mine rock type blocks; Double Axes, which cut wood type blocks; and Spades, which dig earth/dirt/sand type blocks. Their durability is 10% better than vanilla equivalents, regardless of each ore, and their efficiency, which is a bit worse (slower).Besides the regular versions of those tools, there are also enhanced ones. Their durability is 30% better than vanilla equivalents and also the efficiency is a bit higher (faster)! What's the catch with them? They are harder to craft, naturally, for example, you're gonna need an Enhanced Stick instead of a regular one.HAMMERS:Click to revealDOUBLE AXES:Click to revealSPADES:Click to reveal And last but not least, a cherry on top - Spaxers! The mod adds a Spaxer that is a combination of all the other 3 types. It can mine ANY type of block in a 3x3x1 area.Click on the photo below to see what Spaxers can do!SPAXERS:Click to revealADDITIONAL CRAFTINGS:Click to revealYou can join me on my server Marwinekk's mods to see how my mods are being developed. Also, if you like my modding style, you can suggest what next QoL mod I could do for you!Join the discord or donate to support me, so I can improve the mods' quality with more advanced programs!If you wish to use this in a modpack, feel free to do so and let me know if you do!If you'd like to use any of the tools separately, below are the links to them. However, there's no spaxer in them:Hammers: www.curseforge.com/minecraft/mc-mods/hammers-extensionDouble Axes: www.curseforge.com/minecraft/mc-mods/double-axes-extensionSpades: www.curseforge.com/minecraft/mc-mods/spades-extension", "Published time": "1/24/22 9:53 am", "Views": 6140, "Downloads": 857, "Credit": null, "Progress": "100% complete", "Game Version": "Minecraft 1.19.2", "Tags": "Functional, Tools, Tool, Mining, Adventure, Axes, Axe, Rpg, Hammers, Paxel, Spade, Moretools, Hammer, Digging, Cutting, Qol, Paxels, Functionality, Spades, Qualityoflife, 3x3, Aio, Doubleaxe, Hammersmod, Doubleaxes, Axesmod, Doubleaxesmod, Spadesmod, 3x3x1, Spaxer, Spaxers"},
{"Title": "Furniture 3D Pack mod for Minecraft Bedrock edition", "Description": "-----THIS MOD IS ONLY FOR MINECRAFT BEDROCK EDITION----------TURN ON EXPERIEMNTAL GAMEPLAY FOR THIS ADDON TO WORK!----If you are tired of making furniture in Minecraft from steps, signs, hatches or something else and you want real furniture, then this mod is for you. With this mod you can make a beautiful and realistic interior in your house in Minecraft.This mod includes 84 new items in total, including armchairs from all types of wool, sofas from all types of wool, chairs from all types of wood, tables from all types of wood and bedside tables from all types of wood. All items from this addon can be crafted and obtained in survival mode.", "Published time": "11/13/22 8:38 am", "Views": 85, "Downloads": 20, "Credit": null, "Progress": "100% complete", "Game Version": "Minecraft 1.19.2", "Tags": "New Content, Mod, 3d, Furniture, Bedrock, Interior, Minecraftpe, Minecraftpemod, Furnituremod, Pocketedition, Chair, Bedrockedition, Sofa, 3dblocks, Minecraftbedrockedition"},
{"Title": "ohio mod 1.19.2", "Description": "This mod brings a new dimension to the game.There are lots of mobs out at night but it will be worth it. I made a new gold block, when mined it will drop 45 gold ingots which is very good for pigling bartering but is only spawns in the ohio dimension. It replaces deepslate and normal gold ore found under groundminecraft version:1.19.2 forge java", "Published time": "11/13/22 8:15 am", "Views": 48, "Downloads": 1, "Credit": null, "Progress": "100% complete", "Game Version": "Minecraft 1.19.2", "Tags": "Functional, Minecraft, 1192mod, Ahio"},
{"Title": "AstroGUIV2 1.19.2,1.18.2,1.16.5,1.17.1", "Description": "Astroith Cheat menu is a minecraft mod that helps you in your minecraft world. you can use it to troll your friends in your LAN minecraft worldthis mod is just for you if you're scared to die in your hardcore minecraft world. don't be scared its pretty easy to use just press the buttons in the dark menu that appears if you press the TAB button an example is you want a set of netherite armor press tab>combat>(choose armor) boom you're done full set of netherite less than 30 seconds isn't that awesome so why don't you download this mod and raise those numbers. Download Tutorial﻿you want to download this cool mod? then choose you want to download it from curseforge or mediafire? anyways if you want to download it from curseforge what i recommend. then click the black curseforge button it will redirect you to the curseforge page it will say AstroGUI its the same but a other name of course then scroll down until you see Recent Files click the version you want the mod for (newer the better) (older the older) the download will begin if anything pops up at the bottom of the browser then accept it its normal. drag it to the desktop when it finished.in the left corner of your desktop click on the windows search bar and search for %AppData% then search and click .minecraft then search for a mods folder and drag the java file you downloaded into the mods folder your done. launch forge and click TAB the menu should open if not check the controls maybe something is glitched. the same for media fire but you will download all the versions at the same time in a zip file just search for the verison you want and to the same thing i wrote its not that complicated. there are many tutorials on youtube if you want a good tutorial this is the best one﻿ from CraftStones on youtube it even shows you how to download forge if you don't have it.Open Tutorialif you want to open the cheat menu press TAB and the menu will open. if not maybe the controls are broken check the setting and search for cheatmenu or developermenu or something like that then set it to TAB and change the player list to 0 and it should work its the same for mac so just press tab change it if its broken also there are some old menus to like german and hungarian but those are really really hold and i don' recommend using them but they work but they're not up to date so there won't be some features so just forget they're there or i'll delete them it was a old update. bye byeCHEAT LIST:read this list for all the cheats.CHEATS MENUDeafult: changes gamemode to deafult.Spectator: changes gamemode to spectatorAdventure: changes gamemode to adventureSurvival: changes gamemode to survivalCreative: changes gamemode to creativeHealth Boost: boosts your HealthFood Boost: boosts your food to maximum no starving now.Xp Boost: boosts your xp to the maximumSpeed Boost: gives you speed 5 or 2Jump Boost: gives you jump 5 or 2NATUREDay/Night/Midnight/Noon/On/Off: sets time on/off stops or starts timeRain/Thunder/Clear/Deafult/On/Off: sets weather on/off stops weather or starts weatherPeaceful/Easy/Normal/Hard: sets game difficultyCOMBATIron: gives you iron armor and toolschainmail: gives you chainmail armor or stone toolsdiamond: gives you diamond armor and toolsnetherite: gives you netherite armor and tools for itHACKSInfiniteReach: extends reach limit to 1000 blocksAntiknockback: no knockback from damage or anythingArmorUp: gives you full armor without armor onSwimHack: 5x faster swimmingSpeedHack: 5x faster runningHealthHack: doubles healthENCHANTSword: enchantments for swords Pickaxe: enchantments for pickaxeAxe: enchantments for axe Shovel: enchantments for shovelBow: enchantments for bowsCrossbow: enchantemtns for crossbowTrident: enchantemnts for tridentHELPextra stuff about the cheat menuRENAMErename item in your hand towhite/or red.KITSkits for different kinds of things.like going to the end. or starting a new world. or mining a cave.MOBsummon mobs to your location.like a gahst. or a zombie, or a witherskeletonor even a wolfTODO LIST﻿WORLD MENUBlock Menu (REQUESTED) (DONE)PHKCheater Kit (DONE)HELP MENUTutorial menu (DONE)Extra menu moved (DONE)EXTRA MENUmoved to help menu (DONE)PLAYER MENUpage 2 (DONE)DUPE MENU (REQUESTED)IF ITS HAS THISAND (DONE) ITS READYyes i copied it from curseforge i don't give a damn﻿", "Published time": "2/23/21 2:53 pm", "Views": 67639, "Downloads": 12266, "Credit": "Made With Unity :D", "Progress": "60% complete", "Game Version": "Minecraft 1.19.2", "Tags": "Fun, Useful, Gui, Better, Singleplayer, Quick, Other, Top, 1 16 5, Cheatsmods"},
{"Title": "[Flan] Nefarious Army Pack", "Description": "This pack as of now only includes the RKG-3This pack is just a few things I have made for my own personal use. As it uses configs and some content from the Tyrants and Plebeians mod pack the only thing I will upload will be the RKG-3 as it was made standalone. Perhaps if interest is great enough I may upload the remainder. Consider the other elements WIP.I may however be able to convert the PF-98 to a static MC Helicopter vehicle, again if there is enough interest.China  - Type-63 RPG   - PF-98 Recoiless Rifle  - FN-6 MANPADS  - HJ-12 (WIP)Yugoslavia  - M-79 Osa Russia/Soviet Union  - RKG-3 Anti tank grenade", "Published time": "11/12/22 3:56 am", "Views": 175, "Downloads": 17, "Credit": null, "Progress": "100% complete", "Game Version": "Minecraft 1.7.10", "Tags": "Russia, Flans, Flansmod, Flan, Grenade, Military, Other"},
{"Title": "Ore craft", "Description": "This is a modpack that I have created specifically based on getting every item in the game. There are mods like better nether, better end, and Create, and Oh The Bioms you go ,and so on. The modpack is supposed to be on Minecraft 1.18.2 not 1.18. The pack is fabric and no I am not porting it to forge. I will continue to update it through. Please Dimond and Subscribe.", "Published time": "11/12/22 11:26 am", "Views": 243, "Downloads": 60, "Credit": null, "Progress": "100% complete", "Game Version": "Minecraft 1.18", "Tags": "Other"},
{"Title": "MAGIC WEAPON ADDON", "Description": "Selamat datang di xs crafts super kerenDownload gratis ﻿https://youtu.be/27vOiYEv418✅ FOLLOW INSTAGRAM ⬇️https://www.instagram.com/fauzanxs_crafts✅ TIKTOK ⤵️ https://www.tiktok.com/@gamersgeniusxss?_t=8Vo0BDcykVd&_r=1✅ Twitter ⤵️https://twitter.com/fauzanxscrafts?t=MgmrU9mWKzn5zgUEr69AAw&s=09MAGIC WEAPON ADDONyang cocok untuk anak-anak. Jika Anda adalah  nyata, ini adalah tempat yang harus Anda kunjungi!#Minecraft", "Published time": "11/13/22 1:21 am", "Views": 165, "Downloads": 28, "Credit": null, "Progress": "100% complete", "Game Version": "Minecraft 1.19.2", "Tags": "Functional"},
{"Title": "SEC - Super Easy Chairs", "Description": "SEC - Super Easy ChairsTurn any stairs to sittable chairs by just putting a redstone block under it, or just by powering the block under the chair with redstone.InstallationJust drop the jar into your plugins folder, thats all. No configuration!", "Published time": "9/11/22 3:14 am", "Views": 484, "Downloads": 37, "Credit": null, "Progress": "100% complete", "Game Version": "Minecraft 1.19.2", "Tags": "Server, Mechanics, Spigotplugin"},
{"Title": "Seek", "Description": "a mod based off of DOORS a roblox horror game by LSPLASH on roblox! this mod make's zombie's into seek from DOORS a enemy in the game but recoded to be less zombie-ish.", "Published time": "11/13/22 12:32 am", "Views": 74, "Downloads": 0, "Credit": "LSPLASH For the original game on roblox", "Progress": "100% complete", "Game Version": "Minecraft 1.19.2", "Tags": "Doors, Other, Seek, Lsplash"},
{"Title": "[Forge] [1.7 - 1.12] [v2.6.1] FSMM- Fex's Small Money Mod || With working ATM!", "Description": "Spoiler | See for versions bellow 1.4 (MC 1.7 - 1.10)Hallo! This is my new Small Mod!Adds some \"Money\" Items to Minecraft!It was orginally designed for my Modpack server.If you use an Plugin like THIS or THISyou can easly setup it as Ingame Money!(if you need help just PM me!)IMPORTANTFor the \"Advanced Features\", e.g. ATM or the Safe; you need FRSM!(minimum version 1.5.47 for 1.8 Minecraft, ||| 2.6.60 for 1.9 Minecraft)If not using them, you don't need FRSM.The Money/Cash is called ingame \"Foney\"can by easly changed by editing the en_US.lang file in the Zipand textures too... IDC about them, you areallowed to change them, but only for your own use (SP/Server/Modpack/etc.)You must give credit (aka post link to this site) if you areusing it in Server/Modpack,you are not allowed to change the sourcecode(if you find a way to do it 0.o)that's all, have fun! :PVersions 1.4.0+ (1.10+ MC)Versions 1.4.0+ (1.10+ MC)FSMM is a small mod adding some \"Money\" Items to Minecraft.Starting from version 1.4.0 it has a fully working ATM / GUI.//You can deposit your Money Items as currency on your bank Account!Withdraw money from your bank account and receive them as Items.And even transfer from your bank account balance to other players! (case-sensitive)//It's also made that way that other mods can register theyr Items as Money.Aswel as the possiblity for developers to extend the Banking system toadd custom banks and anything they'd need for a realistic gameplay.//ATM VIDEO: https://www.youtube.com/watch?v=oWB_CLsL460Versions 2.0+ (1.12+ MC)The Mod was reworked internally to allow far simpler adding of new Money/Items,especially the possiblity to:- create new Money Items via Config,- assign other mod's items as valid money,- custom Banks and even banking fees.Makes also use of the new Forge Registry System. Guides may be available soon in the Wiki!Another feature is also internal datatype changes which make calculations more reliable.BACKUP YOUR FSMM FOLDER (under /config/) BEFORE UPDATING TO 2.0!Version 2.4.+ (Minecraft 1.12+)A completely new ATM UI was added!You can now:- switch active account (if you have mods providing accounts)- browse available banks- switch the bank your account is in- deposit with overview of item worth in inventory and fees (if any)- withdraw with overview of account balance and fees (if any)- transfer with overview of account balance,and an account browser to select receiveras well as fee info (if any)- and more!VOTIFIER COMPATIBILITYFSMM from version 2.2.4 till version 2.3.2 had inbuilt Voting/ForgeVotifier support.example config: {     \"type\": \"fsmm_item\",     \"worth\": 25500 }, {     \"type\": \"fsmm_currency\",     \"amount\": 200240,     \"message\": \"&7You received %s for voting!\" }\"fsmm_item\" will spawn items with that worth into the players inventory\"fsmm_currency\" will add that amount to the player's account balance\"message\" is optional, if you want an own instead of default.OXYGEN API COMPATIBLEhttps://www.curseforge.com/minecraft/mc-mods/oxygen-currency-providersLisense:http://fexcraft.net/license?id=modsDependencies:(for FSMM 1.4.0 and newer)FCL - Fexcraft Common LibraryDiscord. https://discord.gg/AkMAzaA Like it? Give a Diamond & Favorite!Want more? SubScribe!", "Published time": "1/18/15 8:32 am", "Views": 63552, "Downloads": 15572, "Credit": null, "Progress": "100% complete", "Game Version": "Minecraft 1.12.2", "Tags": "New Content, Mod, Epic, Server, Modpack, Money, Fexcraft, Fex, Cash, Balance, Small, Test"},
{"Title": "Chronokillers_Xenomorph_Aliens_Mod_1.19.2/1.18.2", "Description": "Chronokillers Xenomorph Aliens Mod 1.19.2/1.18.2download 1.19.2 here:https://www.mediafire.com/file/0fbwa5fme2nqete/Chronokillers_XenomorphAliensMod_1.19.2.jar/fileDownload Forge Version 1.19.2 - 43.1.52https://files.minecraftforge.net/net/minecraftforge/forge/index_1.19.2.html THIS MOD IS A XENOMORPH ALIENS MOD.﻿MADE BY SMITTIE ﻿CHECK OUT HIS OTHER WORK www.planetminecraft.com/member/smittie/ THIS MOD CURRENTLY HAS XENOMORPH STANDING MODEL,OLDER XENOMORPH STANDING MODEL ,FLYING MODEL, SWIMMING MODEL ON ALL FOURS MODEL CHEST BURSTER AND FACE HUGGER MOB .3 TYPES OF SPACE MARINES EACH TYPE WITH DIFFERENT WEAPONS. IT ALSO HAS THE SPACE MARINE PULSE RIFLE ,PISTOL AND HICK'S SHOTGUN .M577 VEHICLE , POWER LOADER & POWER LOADER BLACK PLAYER DRIVEN AND SPACE MARINE DRIVEN VERSIONS.MAKE KEYS AND SPAWN THE VEHICLE, SHIP AND POWER LOADERS IN SURVIVAL TO GET AN EDGE ON YOUR ENEMIES.ALL MOBS AND WEAPONS HAVE AUTHENTIC TO THE MOVIES SOUNDSCHECK OUT ALL MY OTHER MODS AND RESOURCE PACKS ON MY MAIN PAGEhttps://www.planetminecraft.com/member/chronokiller2959/pulse rifle black recipepulse rifle shotgun recipepistol recipebullets recipeAdded the ability to craft cheyenne_utility_dropship and M577 . Added work bench make keys then right click the work bench which will spawn the mob for the key you're holding in your right hand work bench recipe piccheyenne key recipe pic TO HOST THIS CONTENT\"M577 key recipe pic \"THIS MOD IS ONLY ALLOWED ON( PLANET MINECRAFT) IF ON ANY OTHER SITE PLEASE LET ME KNOW. I DO NOT GIVE ANY OTHER SITE PERMISSION TO HOST THIS CONTENT\"", "Published time": "9/14/22 8:49 pm", "Views": 1183, "Downloads": 144, "Credit": null, "Progress": "100% complete", "Game Version": "Minecraft 1.19.2", "Tags": "Pistol, Shotgun, Xenomorph, Other, Chronokillers, Spacemarines, Pulserifle, Chestburster, Facehugger, Swimming, Flyingmodel"},
{"Title": "Chronokiller's 1.19.2/1.18.2 Star Wars 257+ creatures , ships, plus", "Description": "Chronokiller's 1.19.2/1.18.2 Star Wars 257+ creatures , ships, plus.....download 1.19.2 here:www.mediafire.com/file/3dusljv9mmu7n8b/Chronokiller%2527s_1.19.2_Star_Wars_255%252B_creatures_%252C_ships%252C_plus.jar/fileDownload Forge Version 1.19.2 - 43.1.52https://files.minecraftforge.net/net/minecraftforge/forge/index_1.19.2.htmlCHECK OUT MY 1.16.5 PAGE FOR CHARACTER PICS https://www.planetminecraft.com/mod/chronokiller-s-star-wars-mobs/Download forge version 1.18.2 - 40.1.0https://files.minecraftforge.net/net/minecraftforge/forge/index_1.18.2.htmlI finally figured out how to do it so here it is(report any bugs to me so i can get them fixed) KEEP AN EYE ON THE MOD THERE WILL BE REGULAR UPDATES59...﻿Ridable mobs=speeder bikes, blurrgs ,banthas, speeder car, AT-RT WALKER, skywalker style land speeder ,imperial troop transport, pod racer ,etcFlyable mobs=X-wing wings open, X-wing wings closed, Tie fighter, advanced tie fighter, black tie fighter, tie bomber, Y-wing ,A-wing, Lambda class T4, Razor Crest ,mining guild Tie, Delta7, etc...PRESS R OR F DEPENDING ON THE MOUNT TO SHOOT SHIPS/VEHICLES BLASTERSSome of the entitysCLONETROOPER'S ,Twi-lek,s, imperial lieutenant,s, Rebels, maul and his troops, Emperors redguard, droidika's, b1_battledroid, hmp droid, vulture droid, Grogu , jedi, transdoshen's,Geonosians, tusken raiders,Moncals, Qaurren's, Gamorrean's,etcMANY MANY MOREMANY ships, speeders, turrets, animals ridable in Star Wars and Clone Wars are now able to be tamed.TAMED RIDABLE LIVING MOUNTS HAVE THEIR OWN INVENTORYCheck out my page for more Chronokiller's star wars mods and texture packsCHECK OUT ALL MY OTHER MODS AND RESOURCE PACKS ON MY MAIN PAGEhttps://www.planetminecraft.com/member/chronokiller2959/Check out my other mods and texture packs here.. www.planetminecraft.com/member/chronokiller2959/https://www.planetminecraft.com/mod/chronokillers-construction-vehicles-plus-mod/https://www.planetminecraft.com/mod/chronokillers-car-and-trucks-mod/https://www.planetminecraft.com/mod/chronokiller-s-mechs/https://www.planetminecraft.com/mod/chronokiller-s-star-wars-block-models-mod/https://www.planetminecraft.com/mod/chronokiller-s-xenomorph-aliens-mod/https://www.planetminecraft.com/mod/chronokiller-s-star-wars-mobs/https://www.planetminecraft.com/mod/chronokiller-s-lightsaber-mod/https://www.planetminecraft.com/mod/chronokiller-s-monster-bots/https://www.planetminecraft.com/mod/chronokiller-s-ed-209/https://www.planetminecraft.com/mod/chronokiller-s-1-15-2-monster-truck-mod/﻿ \"THIS MOD IS ONLY ALLOWED ON( PLANET MINECRAFT) IF ON ANY OTHER SITE PLEASE LET ME KNOW. I DO NOT GIVE ANY OTHER SITE PERMISSION TO HOST THIS CONTENT\"", "Published time": "8/14/22 10:40 pm", "Views": 6109, "Downloads": 1366, "Credit": null, "Progress": "100% complete", "Game Version": "Minecraft 1.19.2", "Tags": "Mod, Mobs, Creatures, Guns, Blasters, Starwars, Ships, Other, Chronokillers, Speeders, Rideablemounts"},
{"Title": "Potato Land 1.19.2", "Description": "It ands potato items to game like armor swords a biome tolls chips tress a monster named potatofoot and new blocks to and liquids like caret waters and this is some of the weeps potatolocher, potato sword, and caret sword and it ads the potato pic and caret pic and the biome is a muntin biome made of potato's.", "Published time": "11/12/22 6:43 pm", "Views": 70, "Downloads": 4, "Credit": null, "Progress": "100% complete", "Game Version": "Minecraft 1.19.2", "Tags": "Other"},
{"Title": "Extra Chests Addon [Lockable]", "Description": "This addon adds more new block chests to the game, and each chest has a different inventory size with a beautiful UI design for each.All Chests are lockable and the lock can be broken using custom items. Each item has a different random chance to break the lock.You may find glitches and errors. Just leave a comment so I do fix the issues in the upcoming updates.For the animation of closing & opening the chests to work, you have to switch to the survival gamemode firstLock System Explanationa) The first player that adds a lock to the chest will be the owner of the chest and he will be the only one who . is able to open the chest.b) If the chest is locked, it will need one hour to break the chest by hand.b) Hostile players can craft custom items to break the lock by using a random system for each item.c) If a player tries to break the lock, random Items will spawn after the animation depending on the item used . and the situation whether successful/failed.e) No player can add a lock to the chest except the owner. To be the owner break the chest and add the first . . lock.CraftingsWhats New in version 1.1 ?1/ Created a new lockable system for all the chests.2/ supported 29 more languages including {TR, JP, FR, UK, GB, etc...}.3/ Added custom items to randomly break the lock.4/ Added Animations with custom sounds for the custom items when breaking the lock.5/ supported version 1.19.40.6/ Version 1.19.20 has been removed.1/ press the link below to go to 'The Brothers' official website page.2/ scroll to the bottom of the page and click on both download buttons, the RP & BP.3/ you will be sent to the Linkvertise website. Complete all of the advertising tasks to reach the download page.4/ After downloading both files click on them to import them into Minecraft. Then activate the files in the world settings and don't forget to activate the experimental settings shown above. Enjoy :)Supported Versions:-1/ Version: 1.19.402/ Version: 1.19.30Important Notes:You are not allowed to redistribute this addon, create your own links, or share the direct link.If you make a review, gameplay, or showcase about this mod, please put the original link (this page or Mcpedle page, or The Brothers Website page).Do not provide the direct link (Mediafire) or any other download link that I didn't provide.", "Published time": "11/12/22 1:48 pm", "Views": 202, "Downloads": 43, "Credit": "The Brothers", "Progress": "90% complete", "Game Version": "Minecraft 1.19.2", "Tags": "New Content, Blocks, Chest, Extra, Block, Edition, Addon, Addons, Brothers, Chests, Lock, Lockable, Bedrock, Quality"},
{"Title": "The Obamium Mod", "Description": "This mod adds the new strongest weapon set in the game!- Obamium Sword- Obamium Pickaxe- Obamium - Obamium OreObamium is extremely rare and can be found in levels 20 to 0.I hope you like the mod!If you find any bugs, things that would be cool to add, or anything else, then be sure to comment them in the description.", "Published time": "11/12/22 4:05 pm", "Views": 102, "Downloads": 22, "Credit": null, "Progress": "100% complete", "Game Version": "Minecraft 1.18.1", "Tags": "Ore, Weapons, Funny, Random, Obama, Meme, Other, Rareitems, Obamium, Obamiumweapons"},
{"Title": "Hypixel SkyblockPlus+ Renew", "Description": "Hello this is an old skyblock mod that has been renewed to make it safe to use with it being confirmed by Hypixel Admins. If you want to see clips and videos about this mod you can go here: https://www.youtube.com/watch?v=Zn4WijUs8gA  if your having any trouble loading or using the mod please let me know and ill get on the issue as soon as i can if you want to privately message me here is my discord: Anne Plank#2910 enjoy the mod and have  a great day!", "Published time": "11/12/22 1:47 pm", "Views": 149, "Downloads": 35, "Credit": "And a huge thanks to DC name Mr.White for helping me when i was a bit stuck.", "Progress": "100% complete", "Game Version": "Minecraft 1.8.9", "Tags": "Functional, Minecraft, Skyblock, Dragon, Hypixel, Drag, Bazaar"},
{"Title": "Atlantide V1", "Description": "Voici la V1 d'Atlantide !Atlantide est un mod permettant d'avoir une nouvelle dimension, un nouveau minerais, des nouveaux outils, une nouvelle, armure et une nouvelle structure. Ce mod permet d'avoir une survie plus longue et un challenge de plus.ATTENTION :Ce mod doit être utilisé avec Forge en 1.18.2.Petit Wiki :- Pour obtenir les nouveaux outils, la nouvelle armure en Atlantide, il faut combiner l'item en netherite avec un lingot d'atlantide dans une table de forgeron.- Les nouveaux hammers cassent en 3x3 et se craftent avec un bâton et six planches de bois, pierres, lingot de fer, (selon le matériel du hammer)...- Pour aller dans l'Atlantheur, il faut obtenir les bloc du portail via un trade avec le forgeron d'outils.- La \"clé\" pour ouvrir la portail se craft avec un bâton et un éclat de prismarine.Here is the V1 of Atlantis!Atlantis is a mod allowing to have a new dimension, a new ores, new tools, a new armor and a new structure. This mod allows you to have a longer survival and an additional challenge.WARNING:This mod must be used with Forge in 1.18.2.Small Wiki:- To obtain the new tools, the new armor in Atlantis, you must combine the 'item in netherite with an ingot of atlantis in a blacksmith's table.- The new hammers break in 3x3 and are crafted with a stick and six planks of wood, stones, iron ingot, (according to the material of the hammer).. .- To go to Atlantheur, you have to get the portal blocks via a trade with the tool smith.- The \"key\" to open the portal is crafted with a stick and a prismarine shard.", "Published time": "11/12/22 1:46 pm", "Views": 60, "Downloads": 10, "Credit": null, "Progress": "100% complete", "Game Version": "Minecraft 1.18", "Tags": "Other"}
]